stm32-hotspot/STWINBX1_WIFI/Projects/STWIN.box/Applications/NetXDuo/Nx_MQTT_Client/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32u5xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32u5xx_hal_def.h"
#include "mx_wifi_conf.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */
#define MXCHIP_SPI      hspi1
void mxchip_WIFI_ISR(uint16_t pin);
/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */
/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */
extern void mxchip_WIFI_ISR(uint16_t pin);
extern void nx_driver_emw3080_interrupt();
/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */
void Success_Handler(void);
/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MXCHIP_FLOW_Pin GPIO_PIN_15
#define MXCHIP_FLOW_GPIO_Port GPIOG
#define MXCHIP_FLOW_EXTI_IRQn EXTI15_IRQn
#define DCDC_EN_Pin GPIO_PIN_5
#define DCDC_EN_GPIO_Port GPIOI
#define LED_GREEN_Pin GPIO_PIN_12
#define LED_GREEN_GPIO_Port GPIOH
#define LED_RED_Pin GPIO_PIN_10
#define LED_RED_GPIO_Port GPIOH
#define MXCHIP_NSS_Pin GPIO_PIN_7
#define MXCHIP_NSS_GPIO_Port GPIOH
#define MXCHIP_NOTIFY_Pin GPIO_PIN_7
#define MXCHIP_NOTIFY_GPIO_Port GPIOE
#define MXCHIP_NOTIFY_EXTI_IRQn EXTI7_IRQn
#define MXCHIP_NSSB12_Pin GPIO_PIN_12
#define MXCHIP_NSSB12_GPIO_Port GPIOB
#define MXCHIP_RESET_Pin GPIO_PIN_12
#define MXCHIP_RESET_GPIO_Port GPIOE

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
